docs/posts/2015-01-13-thoughts-on-burwell-vs-hobby-lobby.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Mar 29, 2025 13:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thoughts on Burwell vs. Hobby Lobby</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link href='/pagefind/pagefind-ui.css' rel='stylesheet'>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Thoughts on Burwell vs. Hobby Lobby</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015 00:00</p>
</header><p>
Social media was certainly inundated with  reactions to yesterday&rsquo;s Supreme Court ruling in <i>Burwell vs. Hobby Lobby</i>. The majority were at the two extremes &#x2014; either this was a great victory for religious liberty and a stunning blow to the Obama administration, or it was an unprecedented power-grab by religious conservatives and wealthy corporate America that will only prevent women from getting the health care that they need.
</p>

<p>
As is generally the case, neither extreme position is correct. The <i>Affordable Care Act</i> is safe, and only certain corporations will be exempt from providing health coverage in very limited instances, provided that the government can easily provide such coverage. So, I don&rsquo;t think that the situation is as bad as some progressives have concluded.
</p>

<p>
That&rsquo;s not to say that I think that the situation is good. I fear that the Supreme Court has placed the government in the position of having to determine what counts as a sincerely held religious belief, which may have more far-reaching implications for religious liberty than simply having to provide comprehensive health coverage.
</p>

<p>
In any case, this is just one of the problems with linking health-coverage and employment. The solution to this and other problems, including the exorbitantly high cost of health care in the United States compared to other countries, is to adopt a single-payer system. 
</p>




<div class="tagline" id="orgf15ffb6">
<p>
Tagged: <a href="../tags/religion.html">Religion</a> <a href="../tags/politics.html">Politics</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Mar 29, 2025 13:16.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
